package com.example.pizzarecipes;

public class Utils {
    public static final String PIZZA_ONE_RECIPE_TITLE = "Пицца-пирог";
    public static final String PIZZA_ONE_RECIPE_DESCTIPTION = "Ананасы, брусника, молоко сгущенноег";
    public static final String PIZZA_ONE_RECIPE = "Муку просеять и смешать с дрожжами\n" +
            "\n" +
            "Теплую (45*С) воду смешать с маслом, сахаром, солью, приправами и томатом\n" +
            "\n" +
            "Тоненькой струйкой влить жидкую смесь в муку и замесить однородное тесто\n" +
            "\n" +
            "Поставить в теплое место на подход на 1 час\n" +
            "\n" +
            "В это время приготовить начинку:\n" +
            "\n" +
            "Сыр натереть на крупной терке.\n" +
            "\n" +
            "Овощи помыть, почистить и порезать кубиками. Морковь натереть на мелкой терке. Курицу сполоснуть, подсушить и порезать тонкими полосками.Грибы разморозить.\n" +
            "\n" +
            "На разогретую сковородку вылить масло, положить лук и обжарить на среднем огне до золотистой корочки.\n" +
            "\n" +
            "Положить остальные овощи и курицу, перемешать и обжаривать 5 минут на среднем огне.\n" +
            "\n" +
            "Добавить грибы, посолить, приправить и потушить под крышкой еще около 5 минут.\n" +
            "\n" +
            "Всыпать 1/3 тертого сыра и перемешать. Остудить до комнатной температуры.\n" +
            "\n" +
            "Когда тесто подойдет, разделить его на 3 части.\n" +
            "\n" +
            "1/3 раскатать на припыленной мукой поверхности в тонкий пласт.\n" +
            "\n" +
            "Форму смазать маслом, выложить на нее тесто, смазать изнутри раст.маслом\n" +
            "\n" +
            "Выложить на тесто начинку, разровнять, посыпать сверху оставшимся сыром, загнуть бортики.\n" +
            "\n" +
            "Взять немного теста, раскатать в тонкий пласт и разрезать на длинные полоски.\n" +
            "\n" +
            "Украсить полосками из теста верх пиццы.\n" +
            "\n" +
            "Взбить яйцо с 1 ч.л. молотого имбиря до пышной массы.";
    public static final String PIZZA_PEPPONI_RECIPE_TITLE = "Пепперониг";
    public static final String PIZZA_PEPPONI_RECIPE_DESCTIPTION = "Пицца-соус, салями из говядины, сыр моцарелла\n";
    public static final String PIZZA_PEPPONI_RECIPE = "Для приготовления идеально тонкой основы, нам понадобятся следующие ингредиенты:\n" +
            "\n" +
            "Вода – чуть больше 1/2 стакана.\n" +
            "\n" +
            "Сухие дрожжи – один пакетик.\n" +
            "\n" +
            "Сахар – чайная ложка.\n" +
            "\n" +
            "Соль – 1,5 ч.л.\n" +
            "\n" +
            "Мука – один стакан.\n" +
            "\n" +
            "Растительное масло (оливковое) – 1 ст.л.\n" +
            "\n" +
            "Первый этап – подготовка дрожжей. Соединяем их с подогретой водой – не горячей, а теплой. Еще один ингредиент для ускорения работы главного сухого компонента теста – сахар. Будет достаточно 1 чайной ложки. Размешиваем, ждем 10 минут, приступаем к приготовлению основы.\n" +
            "\n" +
            "Начинаем с малого – 200 г муки, соединенной с солью. Вливаем в нее дрожжи, разведенные в воде. Вымешиваем, по мере необходимости добавляем муку – не всю, а небольшими порциями, в несколько заходов. Если тесто под руками стало податливым, настало время масла – добавляем его и снова хорошо мешаем. Ком, сформованный вами, должен быть гладким.\n" +
            "\n" +
            "После отставляем приготовленную основу в тепло, накрыв смоченной в воде тканью. Ждем полчаса – за это время дрожжи начнут свою работу, тесто вырастет.\n" +
            "\n" +
            "Затем посыпаем стол мукой и приступаем к раскатыванию лепешки. Чем тоньше, тем лучше – в идеале это не более 3-4 мм. Если хотите, можете сразу обозначить бортики.";
}
